[
  {
    "id": "C001",
    "timestamp": "2025-08-08T10:00:00Z",
    "text": "Me encanta el sabor a coco, ¡es delicioso y super crujiente! Ideal para una merienda rápida. #snack #saludable"
  },
  {
    "id": "C002",
    "timestamp": "2025-08-08T10:30:00Z",
    "text": "El empaque es muy bonito y práctico, pero el precio es un poco alto para la cantidad. #precio #empaque"
  },
  {
    "id": "C003",
    "timestamp": "2025-08-08T11:00:00Z",
    "text": "Esperaba más del sabor a chocolate. Es regular, no es lo que esperaba. #sabor #decepcion"
  },
  {
    "id": "C004",
    "timestamp": "2025-08-08T11:45:00Z",
    "text": "¡Perfecto para llevar! Me da mucha energía sin sentirme pesado. Muy buena calidad."
  },
  {
    "id": "C005",
    "timestamp": "2025-08-08T12:15:00Z",
    "text": "Tuve un problema con la entrega, el paquete llegó abierto. El snack en sí estaba bien, pero la experiencia no. #entrega #problema"
  },
  {
    "id": "C006",
    "timestamp": "2025-08-09T09:00:00Z",
    "text": "El mejor snack de avena que he probado. Textura excelente y sabor auténtico a almendras. ¡Compraré de nuevo!"
  },
  {
    "id": "C007",
    "timestamp": "2025-08-09T09:45:00Z",
    "text": "El dulce es excesivo. Siento que es más una golosina que un snack saludable. #demasiadodulce"
  },
  {
    "id": "C008",
    "timestamp": "2025-08-09T10:30:00Z",
    "text": "Producto promedio. Nada espectacular, pero tampoco malo. Simplemente cumple."
  },
  {
    "id": "C009",
    "timestamp": "2025-08-09T11:15:00Z",
    "text": "Me llegó rápido, pero el producto estaba ligeramente aplastado. Sugiero mejorar el embalaje."
  },
  {
    "id": "C010",
    "timestamp": "2025-08-10T14:00:00Z",
    "text": "Delicioso y nutritivo. ¡Mis hijos lo amaron! Un éxito total en casa. #familia #nutricion"
  },
  {
    "id": "C011",
    "timestamp": "2025-08-10T14:30:00Z",
    "text": "La textura crujiente es adictiva, pero me gustaría que tuvieran una versión sin gluten. #glutenfree #textura"
  },
  {
    "id": "C012",
    "timestamp": "2025-08-10T15:00:00Z",
    "text": "El snack de maní es excelente para un boost de energía antes de mi entrenamiento. ¡Lo recomiendo!"
  },
  {
    "id": "C013",
    "timestamp": "2025-08-10T16:10:00Z",
    "text": "El sabor a arándanos es un poco artificial. Deberían usar ingredientes más naturales. #saborartificial #natural"
  },
  {
    "id": "C014",
    "timestamp": "2025-08-10T17:00:00Z",
    "text": "Me encanta que sea un producto vegano. Es difícil encontrar snacks así. ¡Buen trabajo!"
  },
  {
    "id": "C015",
    "timestamp": "2025-08-11T08:00:00Z",
    "text": "El envase no se puede cerrar una vez abierto, lo que hace que el snack se ponga blando. #empaque #frescura"
  },
  {
    "id": "C016",
    "timestamp": "2025-08-11T09:20:00Z",
    "text": "Por fin un snack saludable que a mis hijos les gusta. Sabor a vainilla es un éxito. #familia #vainilla"
  },
  {
    "id": "C017",
    "timestamp": "2025-08-11T10:00:00Z",
    "text": "La porción es demasiado pequeña para el precio que tiene. Deberían reconsiderarlo. #preciovscantidad"
  },
  {
    "id": "C018",
    "timestamp": "2025-08-11T10:45:00Z",
    "text": "El servicio al cliente fue muy amable y resolvió mi problema de entrega rápidamente. El producto está perfecto."
  },
  {
    "id": "C019",
    "timestamp": "2025-08-11T11:30:00Z",
    "text": "No me gustó el sabor a avena, es muy fuerte. No lo volvería a comprar. #sabor #avena"
  },
  {
    "id": "C020",
    "timestamp": "2025-08-11T12:00:00Z",
    "text": "Llegó antes de lo esperado y en perfectas condiciones. ¡Muy buen servicio y producto!"
  },
  {
    "id": "C021",
    "timestamp": "2025-08-12T13:00:00Z",
    "text": "El snack es bueno, pero el sabor a cacao no es tan intenso como en la foto. Es engañoso. #cacao #marketing"
  },
  {
    "id": "C022",
    "timestamp": "2025-08-12T13:45:00Z",
    "text": "Ideal para una dieta balanceada. Se siente nutritivo y me mantiene lleno por más tiempo. #nutricion #dieta"
  },
  {
    "id": "C023",
    "timestamp": "2025-08-12T14:30:00Z",
    "text": "El snack estaba un poco rancio cuando llegó. Deberían revisar el control de calidad. #calidad #rancio"
  },
  {
    "id": "C024",
    "timestamp": "2025-08-12T15:15:00Z",
    "text": "Me encantó la combinación de semillas y miel. Es mi nuevo snack favorito. #miel #semillas"
  },
  {
    "id": "C025",
    "timestamp": "2025-08-12T16:00:00Z",
    "text": "El producto es muy dulce, no parece tan saludable. #azucar #salud"
  },
  {
    "id": "C026",
    "timestamp": "2025-08-13T09:00:00Z",
    "text": "La textura de los snacks de arroz es increíblemente crujiente. Es muy satisfactorio. #arroz #textura"
  },
  {
    "id": "C027",
    "timestamp": "2025-08-13T09:30:00Z",
    "text": "El empaque es muy difícil de abrir sin que se rompa. Es un problema recurrente. #empaque #packaging"
  },
  {
    "id": "C028",
    "timestamp": "2025-08-13T10:15:00Z",
    "text": "Este snack de frutos secos es mi salvación en el trabajo. Sacia mi hambre y me da energía. #frutossecos #energia"
  },
  {
    "id": "C029",
    "timestamp": "2025-08-13T11:00:00Z",
    "text": "Hay un regusto amargo que no me gusta. Podría ser un problema de ingredientes. #amargo"
  },
  {
    "id": "C030",
    "timestamp": "2025-08-13T11:45:00Z",
    "text": "Me parece que el sabor a fresa es el mejor de todos. Es muy natural y refrescante. #fresa #sabor"
  }
]